vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW236_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MCXW236_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MCXW236</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MCXW236" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <sequences>
        <sequence name="EnableTraceClk">
          <block>
            __var SYSCON_NS_Base_Addr = 0x40000000;
            __var IOCON_NS_Base_Addr  = 0x40001000;
            __var TRACECLKSEL_Addr    = SYSCON_NS_Base_Addr + 0x268;
            __var TRACECLKDIV_Addr    = SYSCON_NS_Base_Addr + 0x308;
            __var AHBCLKCTRLSET0_Addr = IOCON_NS_Base_Addr  + 0x220;
            __var clksel              = 0;
            __var clkdiv              = 0;
          </block>
          <control if="__traceout &amp; 0x3">
            <block>clksel = Read32(TRACECLKSEL_Addr);  // Read current TRACECLKSEL value</block>
            <control if="clksel &gt; 2" info="Trace (TPIU) Clock not selected?">
              <block>Write32(TRACECLKSEL_Addr, 0x0);   // Select Trace divided clock</block>
            </control>
            <block>
              clkdiv = (Read32(TRACECLKDIV_Addr) &amp; 0xFF);  // Read current TRACECLKDIV value, preserve divider but clear rest to enable
              Write32(TRACECLKDIV_Addr, clkdiv);
              
              Write32(AHBCLKCTRLSET0_Addr, (1 &lt;&lt; 13));   // Enable IOCON clock
            </block>
          </control>
        </sequence>
        <sequence name="EnableDebugMailbox">
          <block>
            __var status=0x55aa;
            Message(0, "MCXW23 connect script start");
            
            // Read APIDR
            __dp = 0;
            __ap = 2;
            status = ReadAP(0xFC);
            Message(0, "APIDR: 0x%08X", status);
            
            // Read DPIDR
            __dp = 0;
            __ap = 2;
            status = ReadDP(0x0);
            Message(0, "DPIDR: 0x%08X", status);
            
            // Active DebugMailbox
            __dp = 0;
            __ap = 2;
            WriteAP(0x0, 0x00000021);
            DAP_Delay(30000);
            ReadAP(0x0);
            
            // Enter Debug Session
            __dp = 0;
            __ap = 2;
            WriteAP(0x4, 0x00000007);
            DAP_Delay(30000);
            ReadAP(0x8);
            
            __dp = 0;
            __ap = 0;
            
            Message(0, "MCXW23 connect script end");
          </block>
        </sequence>
        <sequence name="DebugPortStart">
          <block>
            __var SW_DP_ABORT  = 0x0;
            __var DP_CTRL_STAT = 0x4;
            __var DP_SELECT    = 0x8;
            __var powered_down = 0;
            // Switch to DP Register Bank 0
            WriteDP(DP_SELECT, 0x00000000);
            
            // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
            powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
          </block>
          <control if="powered_down">
            <block>
    // Request Debug/System Power-Up
    WriteDP(DP_CTRL_STAT, 0x50000000);
  </block>
            <!-- Wait for Power-Up Request to be acknowledged -->
            <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
            <!-- SWD Specific Part of sequence -->
            <control if="(__protocol &amp; 0xFFFF) == 2">
              <block>
                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                WriteDP(DP_CTRL_STAT, 0x50000F00);
                
                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                WriteDP(SW_DP_ABORT, 0x0000001E);
                
                Sequence("EnableDebugMailbox");
              </block>
            </control>
          </control>
        </sequence>
        <sequence name="DebugDeviceUnlock">
          <control if="__traceout &amp; 0x3" info="Trace output via TPIU selected">
            <block>
              Sequence("EnableTraceClk");       // Enable trace clock to enable TPIU register accesses
            </block>
          </control>
        </sequence>
        <sequence name="ResetCatchSet">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            __var DEMCR_Addr  = SCS_Addr + 0xDFC;
            __var resetVector = 0xFFFFFFFF;                                    // Reset Vector
            // Ready entry point address from flash (always at address 4)
            resetVector = Read32(0x00000004);
          </block>
          <control if="resetVector != 0xFFFFFFFF" info="Breakpoint on user application reset vector">
            <!-- we have a valid breakpoint address -->
            <block>
              Write32(0xE0002008, resetVector|1);                              // Program FPB Comparator 0 with reset handler address
              Write32(0xE0002000, 0x00000003);                                 // Enable FPB
            </block>
          </control>
          <control if="resetVector == 0xFFFFFFFF" info="Enable reset vector catch">
            <!-- we do not have a valid breakpoint address -->
            <block>
              Write32(DEMCR_Addr, (Read32(DEMCR_Addr) | 0x00000001));          // Enable Reset Vector Catch in DEMCR
            </block>
          </control>
          <block>
            // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
            Read32(DHCSR_Addr);
          </block>
        </sequence>
        <sequence name="ResetCatchClear">
          <block>
            __var DEMCR_Addr = 0xE000EDFC;
            
            // Clear FPB Comparators 0 and 1
            Write32(0xE0002008, 0x00000000);
            
            // Disable FPB
            Write32(0xE0002000, 0x00000002);
            
            // Clear Reset Vector Catch
            Write32(DEMCR_Addr, Read32(DEMCR_Addr) &amp; (~0x00000001));
          </block>
        </sequence>
        <sequence name="WaitForStopAfterReset">
          <block>
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            
            // Give bootloader time to do what it needs to do
            DAP_Delay(BootTime);  // try 10ms
            
            Sequence("EnableDebugMailbox");
          </block>
          <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
          <control while="(Read32(DHCSR_Addr) &amp; 0x02000000)" timeout="500000"/>
          <control if="(Read32(DHCSR_Addr) &amp; 0x00020000) == 0">
            <block>
              Write32(DHCSR_Addr, 0xA05F0003);  // Force halt until finding a proper catch. Probably works better from flash.
            </block>
          </control>
        </sequence>
        <sequence name="ResetHardware">
          <block>
            __var nReset      = 0x80;
            __var canReadPins = 0;
            __var SCS_Addr    = 0xE000E000;
            __var DHCSR_Addr  = SCS_Addr + 0xDF0;
            
            // De-assert nRESET line
            canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
          </block>
          <!-- Keep reset active for 50 ms -->
          <control while="1" timeout="50000"/>
          <control if="canReadPins">
            <!-- Assert nRESET line and wait max. 1s for recovery -->
            <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
          </control>
          <control if="!canReadPins">
            <block>
    // Assert nRESET line
    DAP_SWJ_Pins(nReset, nReset, 0);
  </block>
            <!-- Wait 100ms for recovery if nRESET not readable -->
            <control while="1" timeout="100000"/>
          </control>
          <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
            <block>Sequence("WaitForStopAfterReset");</block>
          </control>
        </sequence>
        <sequence name="ResetSystem">
          <block>
            // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
            __var SCS_Addr   = 0xE000E000;
            __var AIRCR_Addr = SCS_Addr + 0xD0C;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            
