vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW236_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter" Cversion="1.0.0" condition="component.trng_adapter.condition_id">
      <description>Component trng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_trng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXW236_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXW236_cmsis</description>
      <files>
        <file category="header" name="devices/MCXW236/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXW236/MCXW236.h" projectpath="device"/>
        <file category="header" name="devices/MCXW236/MCXW236_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXW236/MCXW236_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_ANACTRL.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_CASPER.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_CDOG.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_CRC.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_CTIMER.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_DBGMAILBOX.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_DMA.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLASH_CFPA.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLASH_CMPA.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLASH_KEY_STORE.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLASH_NMPA.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLASH_ROMPATCH.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FLEXCOMM.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_FMU.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_GINT.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_GPIO.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_HASHCRYPT.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_I2C.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_INPUTMUX.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_IOCON.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_MRT.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_NPX.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_OSTIMER.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_PINT.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_PLU.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_PMC.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_PUF.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_PUF_SRAM_CTRL.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_RADIO.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_ROMCP.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_RTC.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_SCT.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_SPI.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_SPIFI.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_SYSCON.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_SYSCTL.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_TRNG.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_USART.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_UTICK.h" projectpath="device/periph4"/>
        <file category="header" name="devices/MCXW236/periph4/PERI_WWDT.h" projectpath="device/periph4"/>
        <file category="include" name="devices/MCXW236/"/>
        <file category="include" name="devices/MCXW236/periph4/"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="MCXW236_flash" Cversion="1.0.0" condition="device.MCXW236_flash.condition_id">
      <description>Device MCXW236_flash</description>
      <files>
        <file category="doc" name="devices/MCXW236/mcuxpresso/device.MCXW236_flash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXW236/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXW236/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXW236_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXW236_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXW236.condition_id" category="linkerScript" attr="config" name="devices/MCXW236/arm/MCXW236_flash.scf" version="1.0.0" projectpath="MCXW236/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXW236.condition_id" category="linkerScript" attr="config" name="devices/MCXW236/gcc/MCXW236_flash.ld" version="1.0.0" projectpath="MCXW236/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXW236.condition_id" category="linkerScript" attr="config" name="devices/MCXW236/iar/MCXW236_flash.icf" version="1.0.0" projectpath="MCXW236/iar"/>
      </files>
    </component>
