vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXW236_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="flexcomm_usart_cmsis" Cversion="2.4.0" Capiversion="2.3.0" condition="driver.cmsis_flexcomm_usart.condition_id">
      <description>USART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/cmsis_drivers/fsl_usart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/cmsis_drivers/fsl_usart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="driver.codec.condition_id">
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c" projectpath="codec"/>
        <file category="include" name="components/codec/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="sourceC" name="devices/MCXW236/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm33.condition_id" category="header" name="devices/MCXW236/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42448" Cversion="2.0.1" condition="driver.cs42448.condition_id">
      <description>Driver cs42448</description>
      <RTE_Components_h>
#ifndef CODEC_CS42448_ENABLE
#define CODEC_CS42448_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42448/fsl_cs42448.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42448/fsl_cs42448.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42448/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cs42888" Cversion="2.1.3" condition="driver.cs42888.condition_id">
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/cs42888/fsl_cs42888.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/cs42888/fsl_cs42888.c" projectpath="codec"/>
        <file category="include" name="components/codec/cs42888/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.3" condition="driver.ctimer.condition_id">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_ctimer.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_ctimer.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dialog7212" Cversion="2.3.1" condition="driver.dialog7212.condition_id">
      <description>Driver dialog7212</description>
      <RTE_Components_h>
#ifndef CODEC_DA7212_ENABLE
#define CODEC_DA7212_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/da7212/fsl_dialog7212.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/da7212/fsl_dialog7212.c" projectpath="codec"/>
        <file category="include" name="components/codec/da7212/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="driver.flexcomm.condition_id">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_flexcomm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_flexcomm.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.3" condition="driver.flexcomm_i2c.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_i2c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_i2c.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.3.1" condition="driver.flexcomm_i2c_dma.condition_id">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_i2c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_i2c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi" Cversion="2.3.2" condition="driver.flexcomm_spi.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="spi_dma" Cversion="2.2.2" condition="driver.flexcomm_spi_dma.condition_id">
      <description>SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_spi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_spi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart" Cversion="2.8.5" condition="driver.flexcomm_usart.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_usart.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_usart.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_dma" Cversion="2.3.1" condition="driver.flexcomm_usart_dma.condition_id">
      <description>usart Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_usart_dma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_usart_dma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gint" Cversion="2.1.1" condition="driver.gint.condition_id">
      <description>GINT Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_gint.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_gint.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="hashcrypt" Cversion="2.2.17" condition="driver.hashcrypt.condition_id">
      <description>Hashcrypt Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_hashcrypt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_hashcrypt.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux" Cversion="2.0.9" condition="driver.inputmux.condition_id">
      <description>INPUTMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_inputmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_inputmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections" Cversion="2.0.0" condition="driver.inputmux_connections.condition_id">
      <description>Inputmux_connections Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_inputmux_connections.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="driver.lpc_crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.3" condition="driver.lpc_dma.condition_id">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXW236/drivers/fsl_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="driver.lpc_gpio.condition_id">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_gpio.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_gpio.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iocon" Cversion="2.2.0" condition="driver.lpc_iocon.condition_id">
      <description>IOCON Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_iocon.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.2.0" condition="driver.lpc_rtc.condition_id">
      <description>RTC Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXW236/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mailbox" Cversion="2.3.4" condition="driver.mailbox.condition_id">
      <description>MAILBOX Driver</description>
      <files>
        <file category="header" name="devices/MCXW236/drivers/fsl_mailbox.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXW236/drivers/"/>
      </files>
    </component>
